In [1]:
import pandas as pd

카드이용데이터 : https://www.kaggle.com/sakshigoyal7/credit-card-customers 

DataUrl =  'https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv'

### Q56. 데이터 로드 및 데이터 행/열 개수 출력

In [5]:
DataUrl = 'https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv'
df = pd.read_csv(DataUrl, index_col=0)

Ans56 = df.shape
Ans56

(10127, 18)

### Q57. Income_Category 카테고리를 map 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑 ★
- Unknown : N 
- Less than 40K : a
- 40K - 60K : b
- 60K - 80K : c
- 80K - 120K : d
- 120K +’ : e

In [11]:
# df.Income_Category.unique()
# '$60K - $80K', 'Less than $40K', '$80K - $120K', '$40K - $60K', '$120K +', 'Unknown'

df['newIncome'] = df.Income_Category.map({'$60K - $80K' : 'c', 
                                          'Less than $40K' : 'a',
                                          '$80K - $120K' : 'd',
                                          '$40K - $60K' : 'b',
                                          '$120K +' : 'e',
                                          'Unknown' : 'N'})
df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,newIncome
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,c
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,a
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,d
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171,a
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,c

★ lambda 이용

In [12]:
mapping_dict = {
    '$60K - $80K' : 'c',
    'Less than $40K' : 'a',
    '$80K - $120K' : 'd',
    '$40K - $60K' : 'b',
    '$120K +' : 'e',
    'Unknown' : 'N'
}

df['newIncome'] = df.Income_Category.map(lambda x: mapping_dict[x])

Ans57 = df.newIncome
Ans57.head()

0    c
1    a
2    d
3    a
4    c
Name: newIncome, dtype: object

### Q58. Income_Category 의 카테고리를 apply 함수를 이용하여 다음과 같이 변경하여 newIncome 컬럼에 매핑 ★
- Unknown : N 
- Less than 40K : a
- 40K - 60K : b
- 60K - 80K : c
- 80K - 120K : d
- 120K +’ : e

In [13]:
def incomeMapping(x) :
    if x == 'Unknown' :
        return 'N'
    elif x == 'Less than $40K' :
        return 'a'
    elif x == '$40K - $60K' :
        return 'b'
    elif x == '$60K - $80K': 
        return 'c'
    elif x == '$80K - $120K' :
        return 'd'
    elif x == '$120K +' :
        return 'e'
    
df['newIncome'] = df.Income_Category.apply(incomeMapping)

df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,newIncome
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,c
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,a
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,d
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171,a
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,c

### Q59. Customer_Age 값 이용하여 나이 구간을 AgeState 컬럼으로 정의하라. (0-9 : 0 , 10-19 :10 , 20-29 :20 … 각 구간의 빈도수를 출력하라

In [16]:
23 // 10 * 10

20

In [19]:
def ageState(x) :
    agestate = x // 10 * 10
    return agestate

df['AgeState'] = df.Customer_Age.apply(ageState)
df.AgeState.value_counts().sort_index()

20     195
30    1841
40    4561
50    2998
60     530
70       2
Name: AgeState, dtype: int64

### Q60. Education_Level 값 중 Graduate 단어가 포함되는 값은 1, 그렇지 않은 경우에는 0으로 변경하여 newEduLevel 컬럼 정의하고 빈도수 출력 ★

In [27]:
df['newEduLevel'] = df.Education_Level.map(lambda x: 1 if 'Graduate' in x else 0)
Ans60 = df.newEduLevel.value_counts()
Ans60

0    6483
1    3644
Name: newEduLevel, dtype: int64

### Q61. Credit_Limit 컬럼값이 4500 이상인 경우 1, 그 외의 경우에는 모두 0으로 하는 newLimit 정의하라. newLimit 각 값들의 빈도수 출력하라.

In [30]:
df['newLimit'] = df.Credit_Limit.map(lambda x: 1 if x >= 4500 else 0)
Ans61 = df.newLimit.value_counts()
Ans61

1    5096
0    5031
Name: newLimit, dtype: int64

### Q62. Marital_Status컬럼값이 Married 이고 Card_Category 컬럼의 값이 Platinum인 경우 1, 그 이외의 경우에는 모두 0으로 하는 newState 컬럼 정의하고, newState 의 각 값들의 빈도수 출력

In [47]:
df['newState'] = 0
df.loc[(df.Marital_Status == 'Married') & (df.Card_Category == 'Platinum'), 'newState'] = 1
df.newState.value_counts()

0    10120
1        7
Name: newState, dtype: int64

In [48]:
def check(x) :
    if x.Marital_Status == 'Married' and x.Card_Category == 'Platinum' :
        return 1
    else :
        return 0
    
df['newState'] = df.apply(check, axis=1) # axis 설정 중요

Ans62 = df['newState'].value_counts()
Ans62

0    10120
1        7
Name: newState, dtype: int64

apply, lambda 써보기

In [50]:
df.apply(lambda x : 1 if (x.Marital_Status == 'Married') and (x.Card_Category == 'Platinum') else 0 , axis = 1).value_counts()

0    10120
1        7
dtype: int64